#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_guardduty_detector.MY-Detector will be created
  + resource "aws_guardduty_detector" "MY-Detector" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = "SIX_HOURS"
      + id                           = (known after apply)
      + tags_all                     = (known after apply)

      + datasources {
          + s3_logs {
              + enable = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @miyamiyab, Action: `pull_request`, Working Directory: `guardduty/prod/all/`, Workflow: `COMMON_TF_TEST`*